tap "homebrew/bundle"
brew "bat"
brew "fd"
brew "fzf"
brew "go"
brew "golangci-lint"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "node"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"
